OpenFOAM-4.x-master/tutorials/mesh/foamyHexMesh/mixerVessel/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

shaftRotating.stl
{
    extractionMethod    extractFromSurface;

    extractFromSurfaceCoeffs
    {
        includedAngle   100;
    }

    subsetFeatures
    {
        // Remove the top feature
        insideBox       (-0.1 -0.1 -0.1)(0.1 0.1 0.1);
    }

    // Write options

        writeObj        yes;
}


vessel.stl
{
    extractionMethod        extractFromSurface;

    extractFromSurfaceCoeffs
    {
        includedAngle       120;
    }

    subsetFeatures
    {
        // Keep nonManifold edges (edges with >2 connected faces where
        // the faces form more than two different normal planes)
        nonManifoldEdges    no;

        // Keep open edges (edges with 1 connected face)
        openEdges           no;
    }

    // Write options

        writeObj            no;
}


spargerInlet.stl
{
    extractionMethod    extractFromSurface;

    extractFromSurfaceCoeffs
    {
        includedAngle   120;
    }

    // Write options

        writeObj        no;
}


stirrer.stl
{
    extractionMethod    extractFromSurface;

    extractFromSurfaceCoeffs
    {
        includedAngle   120;
    }

    // Write options

        writeObj        no;
}


stirrer_baffles.stl
{
    extractionMethod    extractFromSurface;

    extractFromSurfaceCoeffs
    {
        includedAngle   120;
    }

    baffles (stirrer);

    // Write options

        writeObj        no;
}


rotating.stl
{
    extractionMethod    extractFromSurface;

    extractFromSurfaceCoeffs
    {
        includedAngle   120;
    }

    baffles (MRF);

    // Write options

        writeObj        yes;
}


baffles.stl
{
    extractionMethod    extractFromSurface;

    extractFromSurfaceCoeffs
    {
        includedAngle   120;
    }

    baffles (baffles);

    // Write options

        writeObj        no;
}


// ************************************************************************* //
